<template>
    <div class="recipes">
        <div class="card-container">
          <h3 class="card-container-title">Top Artists</h3>
          <div class="list-card">
            <recipes-card 
              v-for="card in listRecept"
              :key="card.title"
              :card="card"
              @selectedCard="selectedCard"
            />
          </div>
        </div>
        <div class="card-container">
          <RecipesCardDetail :carddetail="currentCard"/>
        </div>
    </div>
</template>

<script>
import img1 from '@/assets/Image/img1.jpg'
import RecipesCard from '@/components/RecipesCard'
import RecipesCardDetail from '../components/RecipesCardDetail'

import img2 from "../assets/Image/запечённые_яблоки_с_суфофруктами_и_орехами.jpeg"
import img3 from "../assets/Image/индейка_с_овощами .jpeg"
import img4 from "../assets/Image/куринный_крем_суп.jpeg"
import img5 from "../assets/Image/овсяная_каша_с_яблоком.jpeg"
import img6 from "../assets/Image/рыбацкий_суп_с_треской_и_гребешками .jpeg"
import img7 from "../assets/Image/треска_в_пергаменте_с_сальсой.jpeg"
//import черничные_маффины from "../assets/Image/черничные_маффины"
export default {
  name: 'RecipesList',
  components: {
    RecipesCard,
    RecipesCardDetail
  },
  data() {
    return {
      currentCard: null,
      listRecept: [
        { title: 'Борщ', subtitle: 'Вкусный', img: img1, description:'жидкое блюдо, в составе которого содержится не менее 50 % жидкости. Жидкую часть супа называют основой, плотную — гарниром. Супы готовят на бульонах, отварах, молоке и молочных продуктах и квасе.'},
        { title: 'Заппечённые яблоки', subtitle: 'С сухофруктами и орехами', img: img2,description:"небольшая горсть мелкого темного изюма плоды вяленого инжира – 2 шт. вяленые финики – 2 шт. по 1 ст. л. кедровых орехов, миндаля и кешью молотая корица – 1 ч. л. щепотка имбирного порошка крупные зеленые яблоки (гренни смит или симиренко) – 4 шт. жидкий мед или кленовый сироп для подачи"},
        { title: 'Индейка', subtitle: 'С овощами', img: img3, description:'Подготовим все продукты для запекания индейки с кабачками и помидорами в духовке по списку. Помидоры можно использовать любые, у меня - черри. Приправу для блюда также берите свою любимую. Лук нарезать кубиком, мелко порубить чеснок.Кабачки нарезать полукружочками. Помидоры черри разрезать пополам. Если у вас большой помидор, нарежьте его мелким кубиком.Филе индейки помойте под проточной водой, обсушите кухонным бумажным полотенцем и нарежьте кубиками, размером с половину спичечного коробка.Дальше все просто: в миске перемешать все ингредиенты блюда, добавить приправу для птицы, соль и перец. Влить оливковое масло. Еще раз все перемешать.Выложить индейку с овощами в более плоскую и широкую форму в один слой.Накрыть форму фольгой. Не пропускайте этот шаг. Индейку лучше готовить под фольгой, так она гарантированно останется сочной!Отправить индейку с кабачками и помидорами в духовку, разогретую до 160-170°С, на 30 минут.Подавать индейку с кабачком и помидорами будем порционно, посыпав зеленью укропа.'},
        { title: 'Крем-суп', subtitle: 'Куриный', img: img4, description:"Нарежьте овощи средними кусочками. Выложите в кастрюлю вместе с курицей. Добавьте воду, соль и перец. Варите до мягкости овощей. Когда филе будет готово, вытащите его и мелко нарежьте. Овощи пюрируйте блендером и верните в бульон. Мясо тоже можно измельчить блендером, если хотите однородную структуру. Добавьте курицу и сливки. Доведите суп до кипения."},
        { title: 'Овсянная каша', subtitle: 'С яблоками', img: img5, description: 'Засыпать хлопья в кипящую воду, дождаться повторного закипания, убавить огонь и варить под крышкой примерно 20 минут. Яблоки помыть, почистить и нарезать средними кубиками. Убедиться, что хлопья разварились (примерно 20 минут варки), засыпать яблоки. Довести до кипения. Если хотите, чтобы яблоки чуть хрустели внутри, то сразу выключайте огонь. Если предпочитаете хорошо проваренные яблоки, варите еще 5–7 минут. Укутайте кастрюлю с кашей полотенцем и дайте отдохнуть минут десять.'},
        { title: 'Суп с треской', subtitle: 'И морскими гребешками', img: img6, description: 'Основа для морепродуктов: положите красный лук, перец чили, цедру лимона, чеснок, листья петрушки, тимьян и лавровый лист в кухонный комбайн и измельчите до состояния пасты. Основа для супа: в кастрюле с толстым дном разогрейте оливковое масло и анчоусы на среднем огне, когда анчоусы разварятся, добавьте в масло основу для морепродуктов и готовьте, помешивая, 3-4 минуты, затем добавьте сельдерей, картофель, красный перец, накройте крышкой и готовьте 4-5 минут, периодически помешивая. Добавьте пиво и доведите до кипения. Затем добавьте помидоры и куриный бульон, доведите до кипения, далее кипятите на медленном огне 20 минут или до тех пор, пока объем не уменьшится на треть, затем выключите огонь, остудите и можете хранить суповую основу до следующего приготовления. Разогревание: разогрейте основу для супа на умеренно высоком огне. Поджарьте хлеб в горячей духовке. Когда содержимое закипит, переложите треску и морские гребешки в жидкость, и снова доведите до кипения, варите суп 5-6 минут до готовности рыб, затем выключите огонь. Подавайте суп горячим с большим количеством хлеба.'},
        { title: 'Треска в прегаменте', subtitle: 'С сальсой из помидоров', img: img7, description: 'Установите 2 решётки в верхней и нижней трети духовки и разогрейте духовку до 200°С. Отрежьте от пергаментной бумаги 4 листа длиной 40 см. В небольшой миске смешайте помидоры, каперсы, 3 ст. л. оливкового масла, цедру и сок лимона, лук-шалот, базилик, 0,5 ч. л. соли и немного молотого чёрного перца. Отложите в сторону, чтобы все вкусы смешались. Сложите каждый лист пополам и откройте как книгу. Разложите листы пергамента на 2-х противнях (по 2 штуки на каждом). В миске смешайте кукурузу и зелёную фасоль с оставшейся 1 ст. л. оливкового масла, 0,5 ч. л. соли и небольшим количеством молотого чёрного перца. Разделите всё равномерно по 4 пергаментным листам, выложив смесь на одну сторону сгиба. Посыпьте каждое филе трески 1/4 ч. л. соли и положите сверху на овощи. Посыпьте кусочками сливочного масла и сбрызните вином. Накройте сверху половиной пергамента, обжимая и плиссируя небольшими складками вдоль открытого края, чтобы плотно запечатать всё внутри. Запекайте, пока пергамент не вздуется, примерно 15 минут; рыба будет нежной полностью пропечённой. Разложите свёртки по тарелкам. Стараясь не обжечься паром, осторожно разверните бумагу. Выложите сальсу из помидоров и базилика на каждый кусок рыбы и сразу же подавайте.'},
      ],
    }
  },
  methods: {
    selectedCard(card) {
      this.currentCard = card
    }
  }
}
</script>

<style scoup>
.recipes {
    display: grid;
    grid-template-columns: 1fr 300px;
    gap: 16px;
}
.card-container {
    background-color: rgba(32, 32, 32, 0.86);
    border-radius: 32px;
    padding: 16px;
}
.card-container-title {
  font-size: 16px;
  margin-bottom: 24px;
  margin-left: 10px;
}

.list-card {
  display: grid;
  grid-template-columns: 1fr 1fr 1fr 1fr;
  gap: 24px;
}
</style>
